jmeter/report/statistics.json
{
  "1. Login" : {
    "transaction" : "1. Login",
    "sampleCount" : 30,
    "errorCount" : 3,
    "errorPct" : 10.0,
    "meanResTime" : 51.53333333333334,
    "medianResTime" : 50.0,
    "minResTime" : 6.0,
    "maxResTime" : 117.0,
    "pct1ResTime" : 61.0,
    "pct2ResTime" : 88.39999999999996,
    "pct3ResTime" : 117.0,
    "throughput" : 6.543075245365322,
    "receivedKBytesPerSec" : 8.630810387131952,
    "sentKBytesPerSec" : 3.3482142857142856
  },
  "2. Listar Personas" : {
    "transaction" : "2. Listar Personas",
    "sampleCount" : 30,
    "errorCount" : 5,
    "errorPct" : 16.666666,
    "meanResTime" : 10.1,
    "medianResTime" : 9.0,
    "minResTime" : 2.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 16.800000000000004,
    "pct2ResTime" : 19.45,
    "pct3ResTime" : 20.0,
    "throughput" : 6.606474344857961,
    "receivedKBytesPerSec" : 158.08355469610217,
    "sentKBytesPerSec" : 3.3225920777361813
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 120,
    "errorCount" : 15,
    "errorPct" : 12.5,
    "meanResTime" : 19.08333333333333,
    "medianResTime" : 9.0,
    "minResTime" : 2.0,
    "maxResTime" : 117.0,
    "pct1ResTime" : 52.0,
    "pct2ResTime" : 59.799999999999955,
    "pct3ResTime" : 106.07999999999959,
    "throughput" : 26.03601648947711,
    "receivedKBytesPerSec" : 488.82324324690825,
    "sentKBytesPerSec" : 13.189632376871339
  },
  "3. Listar Vehiculos" : {
    "transaction" : "3. Listar Vehiculos",
    "sampleCount" : 30,
    "errorCount" : 5,
    "errorPct" : 16.666666,
    "meanResTime" : 7.066666666666666,
    "medianResTime" : 6.5,
    "minResTime" : 2.0,
    "maxResTime" : 15.0,
    "pct1ResTime" : 11.800000000000004,
    "pct2ResTime" : 13.899999999999999,
    "pct3ResTime" : 15.0,
    "throughput" : 6.5992080950285965,
    "receivedKBytesPerSec" : 132.9224868015838,
    "sentKBytesPerSec" : 3.3382712824461063
  },
  "4. Listar Comparendos" : {
    "transaction" : "4. Listar Comparendos",
    "sampleCount" : 30,
    "errorCount" : 2,
    "errorPct" : 6.6666665,
    "meanResTime" : 7.6333333333333355,
    "medianResTime" : 7.0,
    "minResTime" : 5.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 11.0,
    "pct2ResTime" : 14.249999999999996,
    "pct3ResTime" : 17.0,
    "throughput" : 6.593406593406593,
    "receivedKBytesPerSec" : 195.8881353021978,
    "sentKBytesPerSec" : 3.3353365384615388
  }
}