jmeter/reports/flujo_completo/statistics.json
{
  "1. Login" : {
    "transaction" : "1. Login",
    "sampleCount" : 1000,
    "errorCount" : 304,
    "errorPct" : 30.4,
    "meanResTime" : 20701.754000000008,
    "medianResTime" : 21741.0,
    "minResTime" : 797.0,
    "maxResTime" : 30958.0,
    "pct1ResTime" : 30002.0,
    "pct2ResTime" : 30011.95,
    "pct3ResTime" : 30062.98,
    "throughput" : 15.698340685389557,
    "receivedKBytesPerSec" : 16.250220144699455,
    "sentKBytesPerSec" : 6.933944816407906
  },
  "2. Listar Personas" : {
    "transaction" : "2. Listar Personas",
    "sampleCount" : 1000,
    "errorCount" : 305,
    "errorPct" : 30.5,
    "meanResTime" : 667.6309999999999,
    "medianResTime" : 198.5,
    "minResTime" : 7.0,
    "maxResTime" : 11020.0,
    "pct1ResTime" : 1787.9999999999998,
    "pct2ResTime" : 2371.2999999999993,
    "pct3ResTime" : 4357.26,
    "throughput" : 15.90988640341108,
    "receivedKBytesPerSec" : 319.28101421051167,
    "sentKBytesPerSec" : 6.749272122697044
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 4000,
    "errorCount" : 919,
    "errorPct" : 22.975,
    "meanResTime" : 5521.845999999996,
    "medianResTime" : 294.5,
    "minResTime" : 7.0,
    "maxResTime" : 30958.0,
    "pct1ResTime" : 25149.500000000007,
    "pct2ResTime" : 29994.0,
    "pct3ResTime" : 30017.0,
    "throughput" : 61.443932411674346,
    "receivedKBytesPerSec" : 1069.819553451421,
    "sentKBytesPerSec" : 26.42419114823349
  },
  "3. Listar Vehiculos" : {
    "transaction" : "3. Listar Vehiculos",
    "sampleCount" : 1000,
    "errorCount" : 310,
    "errorPct" : 31.0,
    "meanResTime" : 245.18499999999986,
    "medianResTime" : 88.0,
    "minResTime" : 9.0,
    "maxResTime" : 30004.0,
    "pct1ResTime" : 423.4999999999999,
    "pct2ResTime" : 692.9499999999999,
    "pct3ResTime" : 1358.92,
    "throughput" : 15.643821472709353,
    "receivedKBytesPerSec" : 262.59952464781844,
    "sentKBytesPerSec" : 6.682233898596749
  },
  "4. Listar Comparendos" : {
    "transaction" : "4. Listar Comparendos",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 472.81399999999985,
    "medianResTime" : 191.0,
    "minResTime" : 20.0,
    "maxResTime" : 9794.0,
    "pct1ResTime" : 1100.3999999999999,
    "pct2ResTime" : 1469.6999999999996,
    "pct3ResTime" : 7627.140000000014,
    "throughput" : 15.697601406505084,
    "receivedKBytesPerSec" : 498.4908227897777,
    "sentKBytesPerSec" : 6.705205913286449
  }
}